Rust/1.Introduction/What_and_who.org
#+TITLE: What is Rust And Who is it for ?
#+DESCRIPTION: Introction part one
#+AUTHOR: Arnav Banerjee


* WHAT IS THIS WIERD LANGUAGE EXACTLY ?


** This is how the Rust Book Defines it :->

#+begin_verse
 The Rust programming language helps you write faster, more reliable software. High-level ergonomics and low-level control are often at odds in programming language design; Rust challenges that conflict. Through balancing powerful technical capacity and a great developer experience, Rust gives you the option to control low-level details (such as memory usage) without all the hassle traditionally associated with such control.
                                               - Rust Book

#+end_verse
