Rust/1.Introduction/What_and_who.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-11 Mon 18:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>What is Rust And Who is it for ?</title>
<meta name="author" content="Arnav Banerjee" />
<meta name="description" content="Introction part one" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">What is Rust And Who is it for ?</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5885a92">1. WHAT IS THIS WIERD LANGUAGE EXACTLY ?</a>
<ul>
<li><a href="#org25fe06e">1.1. This is how the Rust Book Defines it :-&gt;</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org5885a92" class="outline-2">
<h2 id="org5885a92"><span class="section-number-2">1.</span> WHAT IS THIS WIERD LANGUAGE EXACTLY ?</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org25fe06e" class="outline-3">
<h3 id="org25fe06e"><span class="section-number-3">1.1.</span> This is how the Rust Book Defines it :-&gt;</h3>
<div class="outline-text-3" id="text-1-1">
<p class="verse">
The Rust programming language helps you write faster, more reliable software. High-level ergonomics and low-level control are often at odds in programming language design; Rust challenges that conflict. Through balancing powerful technical capacity and a great developer experience, Rust gives you the option to control low-level details (such as memory usage) without all the hassle traditionally associated with such control.<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;- Rust Book<br />
<br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Banerjee</p>
<p class="date">Created: 2021-10-11 Mon 18:08</p>
</div>
</body>
</html>
